DiplomT/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненыеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРаботы</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomT/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomT/src/AccumulationRegisters/ВКМ_Взаиморасчеты/ВКМ_Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomT/src/AccumulationRegisters/ВКМ_ВыполненыеСотрудникомРаботы/ВКМ_ВыполненыеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненыеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomT/src/InformationRegisters/ВКМ_УсловияОплатыСотрудника/ВКМ_УсловияОплатыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудника</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DiplomT/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Администрация</name>
  </enumValues>
  <enumValues>
    <name>Специалисты</name>
  </enumValues>
</mdclass:Enum>

DiplomT/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

DiplomT/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomT/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Область ОбработчикиСобытий
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = Клиент;
	Движение.ВКМ_Договор = Договор;
	ЧасыКОплате = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
	Движение.ВКМ_КоличествоЧасов = ЧасыКОплате;
	
	Запрос = Новый Запрос;
	запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентов.Специалист,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиентов.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
		
	Движение.ВКМ_СуммаКОплате = Движение.ВКМ_КоличествоЧасов * Выборка.ВКМ_СтоимостьЧасаРаботы;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	//***Взаимросчеты
	
	Движение = Движения.ВКМ_Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	ЧасыКОплате = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
	
	СтавкаЧасаСпециалиста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
	Движение.Сумма = ЧасыКОплате * СтавкаЧасаСпециалиста;
	
	Движения.ВКМ_Взаиморасчеты.Записать();
	
	
	//---Взаиморасчеты
	
	
	Движение = Движения.ВКМ_ВыполненыеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудникаСрезПоследних.ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудникаСрезПоследних.Подразделение
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудника.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник",Специалист );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	Если  Выборка.Подразделение = Перечисления.ВКМ_КатегорииСотрудников.Специалисты И Выборка.ПроцентОтРабот = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Установите процент премии сотруднику!";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Иначе
	
	Движение.СуммаКОплате = Движение.ЧасовКОплате * СтавкаЧасаСпециалиста * Выборка.ПроцентОтРабот / 100;
	
	КонецЕсли;
	
	Движения.ВКМ_ВыполненыеСотрудникомРаботы.Записать();
	
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	 
      ВидДоговораКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");

	Если ВидДоговораКонтрагента <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ОбщегоНазначения.СообщитьПользователю(
   НСтр("ru = 'Вид договора не соответсвует! Выберите договор на Абонентское обслуживание.'"), , "ВКМ_Договор");

		Отказ = Истина;

	КонецЕсли;
	
	ДатаДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВКМ_НачалоПериодаДействия, 
																		   |ВКМ_КонецПериодаДействия ");

	Если ДатаДоговора.ВКМ_КонецПериодаДействия < Дата И ДатаДоговора.ВКМ_НачалоПериодаДействия > Дата Тогда
		ОбщегоНазначения.СообщитьПользователю(
   НСтр("ru = 'Дата не соотвествует периоду действия договора!'"), , "Дата");

		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


//***ВКМ_Доработка
#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьОбъектДляЗаписи() Экспорт
	
	ФорматДатыДляЗаписи = Лев(Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), 10);

	ФорматВремяНачало = Лев(Формат(ВремяНачалаРаботПлан, "ДЛФ=T;"), 8);

	ФорматВремяОкончания = Лев(Формат(ВремяОкончанияРаботПлан, "ДЛФ=T;"), 8);

	ТекстУведомленияБота = СтрШаблон("Специалист: %1,
									 |Дата: %2,
									 |Время Начала: %3,
									 |Время Окончания: %4.", Специалист, ФорматДатыДляЗаписи,
		ФорматВремяНачало, ФорматВремяОкончания);
		
		ЭлементСправочникаУведомлений = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		ЭлементСправочникаУведомлений.Текст = ТекстУведомленияБота;
				
		ЭлементСправочникаУведомлений.Записать();
	
	
КонецПроцедуры





#КонецОбласти
//---ВКМ_Доработка
